# DragOnSelection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionUIOptions..::..DragOnSelection Property
SelectionUIOptions Class See Also
---
Indicates whether elements can be dragged immediately when they are selected.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool DragOnSelection { get; set; }
```

Visual Basic
---
```text
Public Property DragOnSelection As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool DragOnSelection {
	bool get ();
	void set (bool value);
}
```

# Remarks
When this setting is false, the user must click once to select an element and then must explicitly click again in order to drag the element. This option helps users avoid accidentally moving elements. When this setting is true, the user can click on an element to select it and drag the element immediately by holding down the mouse.
# See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace